local AddMusic = AddMusic
AddMusic("SCORE", 62.45, 55.11, "Player's Score", true)
AddMusic("Bad Apple!!", 219.16, 219.16, "Bad Apple!!")
AddMusic("SUMMARY", 97, 97, "Eris - Yume, Maboroshi")

AddMusic("TH00_0", 62.45, 55.11, "未命名关卡")

AddMusic("TH01_0", 62.45, 55.11, "水月")

AddMusic("TH02_0", 62.45, 55.11, "星河")

AddMusic("TH03_0", 62.45, 55.11, "白玉楼")

AddMusic("TH04_0", 62.45, 55.11, "彼岸")
AddMusic("TH05_0", 62.45, 55.11, "花园")

AddMusic("TH19_0", 62.45, 55.11, "地底")

AddMusic("TH06_0", 150.65, 117.45, "魔法少女達の百年祭")
AddMusic("TH06_1", 122.02, 122.02, "U.N.オーエンは彼女なのか？")

AddMusic("TH07_0", 152.39, 139.06, "東方妖々夢")
AddMusic("TH07_1", 140.901, 126.729, "幽雅に咲かせ、墨染の桜")
AddMusic("TH07_2", 165.85, 165.4, "ネクロファンタジア")

AddMusic("TH08_3", 170.87, 167.79, "シンデレラケージ")
AddMusic("TH08_5", 169.78, 169.224, "月まで届け、不死の煙")
AddMusic("TH08_7", 80.11, 77.01, "ヴォヤージュ1969")
AddMusic("TH08_NEW_0", 83, 83, "NAGI☆ - Candor")
AddMusic("TH08_NEW_1", 119, 119, "魂音泉 - Interlude ~Emerald~")
AddMusic("TH08_NEW_2", 242, 242, "sound sepher - 幽霊楽団")
AddMusic("TH08_NEW_3", 117, 117, "ERIS - AM7：15")

AddMusic("TH09_2", 128.5, 125.446, "フラワリングナイト")
AddMusic("TH09_5", 248.4, 248.407, "六十年目の東方裁判")
AddMusic("TH09_5_0", 97.56, 93.09, "レトロスペクティブ京都")
AddMusic("TH09_5_1", 127.25, 126.6, "東の国の眠らない夜")
AddMusic("TH09_5_4", 197.82, 191.85, "御伽の国の鬼が島")

AddMusic("TH10_2", 156.88, 133.99, "神さびた古戦場")
AddMusic("TH10_4", 198.86, 198.16, "明日ハレの日、ケの昨日")

AddMusic("TH11_0", 185.72, 184.72, "ラストリモート")

AddMusic("TH12_0", 109.72, 98.75, "法界の火")
AddMusic("TH12_1", 213.26, 213.26, "感情の摩天楼")

AddMusic("TH12_5_0", 163.08, 145.08, "無間の鐘")
AddMusic("TH12_5_1", 108.74, 95.6, "あなたの町の怪事件")
AddMusic("TH12_5_2", 134.78, 117.75, "黄昏フロンティア - 有頂天変")

AddMusic("TH12_8_2", 99.66, 99.62, "妖精大戦争")

AddMusic("TH13_0", 115.72, 115.32, "夢殿大祀廟")
AddMusic("TH13_1", 182.23, 169.86, "聖徳伝説")

AddMusic("TH14_0", 224.41, 222.41, "輝く針の小人族")

AddMusic("TH14_3_0", 126.96, 112.25, "不可能弾幕には反則を")
AddMusic("TH14_3_1", 197.84, 194.43, "永遠の三日天下")

AddMusic("TH15_0", 152.73, 152.73, "故郷の星が映る海")
AddMusic("TH15_1", 284.3, 278.14, "心の在処")

AddMusic("TH16_0", 208.06, 170.82, "禁断の扉の向こうは、この世かあの世か")
AddMusic("TH16_1", 189.97, 183.89, "秘匿されたフォーシーズンズ")


AddMusic("TH16_5_0", 120.37, 86.76, "燕石博物誌が連れてきた闇")

AddMusic("TH17_0", 118.2, 81.46, "エレクトリックヘリテージ")
AddMusic("TH17_1", 228.7, 204, "偶像に世界を委ねて")

AddMusic("TH18_0", 170.59, 169.82, "待ちわびた逢魔が時")
AddMusic("TH18_1", 313.83, 223.35, "あの賑やかな市場は今どこに")

AddMusic("TH18_5_0", 189.25, 156.24, "闇市場は場所を選ばない")

AddMusic("TH16_AEX_0", 387.42,387.42, "XL project - Last Drop")
AddMusic("TH16_AEX_1", 227.78,126.11, "桜色の海を泳いで")
AddMusic("TH16_AEX_2", 99.77,24.45, "白い旅人", true)

